In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [2]:
dframe = DataFrame(
    {
     'k1':['X','X','Y','Y','Z'],
     'k2':['alpha','beta','alpha','beta','alpha'],
     'dataset1':np.random.randn(5),
     'dataset2':np.random.randn(5)
    }
)
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.435929  0.027685
1  X   beta -0.006727  1.066051
2  Y  alpha -1.107761  0.173525
3  Y   beta -1.116349  0.809931
4  Z  alpha -1.385159 -0.256890

In [3]:
group1 = dframe['dataset1'].groupby(dframe['k1'])
group1

In [4]:
group1.mean()

k1
X   -0.221328
Y   -1.112055
Z   -1.385159
Name: dataset1, dtype: float64

In [5]:
cities = np.array(['NY','LA','LA','NY','NY'])
month = np.array(['JAN','FEB','JAN','FEB', 'JAN'])

In [6]:
dframe['dataset1'].groupby([cities,month]).mean()

LA  FEB   -0.006727
    JAN   -1.107761
NY  FEB   -1.116349
    JAN   -0.910544
Name: dataset1, dtype: float64

In [7]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.435929  0.027685
1  X   beta -0.006727  1.066051
2  Y  alpha -1.107761  0.173525
3  Y   beta -1.116349  0.809931
4  Z  alpha -1.385159 -0.256890

In [8]:
dframe.groupby('k1').mean()

    dataset1  dataset2
k1
X  -0.221328  0.546868
Y  -1.112055  0.491728
Z  -1.385159 -0.256890

In [9]:
dframe.groupby(['k1', 'k2']).mean()

          dataset1  dataset2
k1 k2
X  alpha -0.435929  0.027685
   beta  -0.006727  1.066051
Y  alpha -1.107761  0.173525
   beta  -1.116349  0.809931
Z  alpha -1.385159 -0.256890

In [10]:
dframe.groupby(['k1']).size()

k1
X    2
Y    2
Z    1
dtype: int64

In [11]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.435929  0.027685
1  X   beta -0.006727  1.066051
2  Y  alpha -1.107761  0.173525
3  Y   beta -1.116349  0.809931
4  Z  alpha -1.385159 -0.256890

In [12]:
for name, group in dframe.groupby('k1'):
    print("This is the %s group" %name)
    print(group)
    print("\n")

This is the X group
  k1     k2  dataset1  dataset2
0  X  alpha -0.435929  0.027685
1  X   beta -0.006727  1.066051


This is the Y group
  k1     k2  dataset1  dataset2
2  Y  alpha -1.107761  0.173525
3  Y   beta -1.116349  0.809931


This is the Z group
  k1     k2  dataset1  dataset2
4  Z  alpha -1.385159  -0.25689

In [13]:
for (k1, k2), group in dframe.groupby(['k1', 'k2']):
    print("Key1 = %s Key2 %s" % (k1, k2))
    print(group)
    print("\n")

Key1 = X Key2 alpha
  k1     k2  dataset1  dataset2
0  X  alpha -0.435929  0.027685


Key1 = X Key2 beta
  k1    k2  dataset1  dataset2
1  X  beta -0.006727  1.066051


Key1 = Y Key2 alpha
  k1     k2  dataset1  dataset2
2  Y  alpha -1.107761  0.173525


Key1 = Y Key2 beta
  k1    k2  dataset1  dataset2
3  Y  beta -1.116349  0.809931


Key1 = Z Key2 alpha
  k1     k2  dataset1  dataset2
4  Z  alpha -1.385159  -0.25689

In [14]:
group_dict = dict(list(dframe.groupby('k1')))
group_dict

{'X':   k1     k2  dataset1  dataset2
 0  X  alpha -0.435929  0.027685
 1  X   beta -0.006727  1.066051, 'Y':   k1     k2  dataset1  dataset2
 2  Y  alpha -1.107761  0.173525
 3  Y   beta -1.116349  0.809931, 'Z':   k1     k2  dataset1  dataset2
 4  Z  alpha -1.385159  -0.25689}

In [15]:
group_dict['X']

  k1     k2  dataset1  dataset2
0  X  alpha -0.435929  0.027685
1  X   beta -0.006727  1.066051

In [16]:
group_dict_axis = dict(list(dframe.groupby(dframe.dtypes, axis=1)))

In [17]:
group_dict_axis

{dtype('float64'):    dataset1  dataset2
 0 -0.435929  0.027685
 1 -0.006727  1.066051
 2 -1.107761  0.173525
 3 -1.116349  0.809931
 4 -1.385159 -0.256890, dtype('O'):   k1     k2
 0  X  alpha
 1  X   beta
 2  Y  alpha
 3  Y   beta
 4  Z  alpha}

In [18]:
dframe

  k1     k2  dataset1  dataset2
0  X  alpha -0.435929  0.027685
1  X   beta -0.006727  1.066051
2  Y  alpha -1.107761  0.173525
3  Y   beta -1.116349  0.809931
4  Z  alpha -1.385159 -0.256890

In [19]:
dataset2_group = dframe.groupby(['k1', 'k2'])[['dataset2']]

In [20]:
dataset2_group.mean()

          dataset2
k1 k2
X  alpha  0.027685
   beta   1.066051
Y  alpha  0.173525
   beta   0.809931
Z  alpha -0.256890